// import '../../App.css';
// import { getJson, postJson, deleteJson } from './fetch';


function Questions() {
  return (
    <article className="containerCat text-justify text-[#e0e0e0] pb-10">
      <h2 className="text-lg py-5 font-bold">سوالات متداول</h2>
      <h3 className="text-sm py-4 font-bold">دانلود برنامه اندروید از مایکت چگونه است؟</h3>
      <p className="text-sm">برای دانلود برنامه ها، ابتدا باید اپلیکیشن مایکت را روی گوشی خود نصب کرده و سپس در نوار جستجو، نام نرم‌افزار دلخواه را بنویسید. در صورتی که هیچ نرم‌افزار معتبری را نمی‌شناسید، می‌توانید به دسته‌بندی‌های مایکت سر زده و اپلیکیشن‌های برتر هر دسته را ببینید.</p>
      <h3 className="text-sm py-4 font-bold">آیا همه برنامه ها روی گوشی و تبلت نصب می‌شوند؟</h3>
      <p className="text-sm">بیشتر نرم‌افزارهای موجود در مایکت با تمام گوشی‌ها و تبلت‌ها سازگاری دارند؛ در صورتی که اپلیکیشنی از دستگاه شما پشتیبانی نکند، امکان دانلود آن را نخواهید داشت.</p>
      <h3 className="text-sm py-4 font-bold">آیا با دانلود برنامه اندروید از مایکت، ترافیک کمتری مصرف می‌شود؟</h3>
      <p className="text-sm">بله؛ ترافیک تمام داده‌هایی که از طریق مایکت ردوبدل می‌شوند، به صورت نیم‌بها محاسبه خواهد شد.</p>
      <h3 className="text-sm py-4 font-bold">چگونه بهترین برنامه اندروید را پیدا کنیم؟</h3>
      <p className="text-sm">امتیاز و تعداد دانلودهای هر برنامه در کنار نظراتی که کاربران ثبت کرده‌اند، بهترین مرجع برای پیدا کردن برنامه‌های برتر هستند.</p>
    </article>
  );
}

export default Questions;

