// import '../../App.css';
// import { getJson, postJson, deleteJson } from './fetch';

import { useState } from 'react';
import { IoIosArrowDown } from "react-icons/io";
import { IoIosArrowUp } from "react-icons/io";

function Description() {
  const [descClass, setDescClass]= useState("relative containerCat py-5 text-justify text-[#e0e0e0] smallDesc");
  const [descBtnContent, setDescBtnContent] = useState(<>مشاهده بیشتر <IoIosArrowDown className='inline' size={18} /> </>);
  function descManager(){
    if(descClass==="relative containerCat py-5 text-justify text-[#e0e0e0] smallDesc"){
      setDescClass("relative containerCat py-5 text-justify text-[#e0e0e0]");
      setDescBtnContent(<>مشاهده کمتر <IoIosArrowUp className='inline' size={18} /> </>);
    }
    else{
      setDescClass("relative containerCat py-5 text-justify text-[#e0e0e0] smallDesc");
      setDescBtnContent(<>مشاهده بیشتر <IoIosArrowDown className='inline' size={18} /> </>);
    }
    //console.log(descClass)
  }
  return (
    <>
      <article id="longDescription" className={descClass}>
        <p className="text-sm">یکی از مهم‌ترین بخش‌های <strong> استور اندرویدی مایکت </strong> ، امکان <strong> دانلود بازی های اندرویدی </strong> برای گوشی‌های هوشمند است. خوشبختانه، تنوع <strong> بازی های مایکت </strong> بسیار بالاست و کاربران این امکان را دارند که از میان دسته‌بندی‌های مختلف این پلتفرم، عنوان دلخواه خود را انتخاب کرده و از انجام آن نهایت لذت را ببرند. این اپلیکیشن همچنین امکانات بسیار گسترده‌ای را برای بازی‌دوستان ارائه می‌کند که در کمتر پلتفرمی می‌توان آنها را پیدا کرد.</p>
        <h2 className="text-lg py-5 font-bold">دانلود بازی اندروید رایگان</h2>
        <p className="text-sm">شما برای استفاده از این اپلیکیشن، نیاز به پرداخت هیچ هزینه‌ای ندارید و به صورت کاملا رایگان می‌توانید تمام بازی‌ها را روی گوشی خود نصب کنید. به علاوه، در برخی از عناوین می‌توان سیستم پرداخت درون برنامه‌ای را پیدا کرد که کاربران می‌توانند از طریق بستری امن، پرداخت‌های خود را انجام دهند.</p>
        <p className="text-sm">سرعت بالای سرورهای مایکت هم از دیگر مزایایی است که کمک می‌کند تا کارها را خیلی سریع‌تر و ساده‌تر انجام دهید. این سرویس با استفاده از سیستم هوش مصنوعی، سرعت دانلود را به بالاترین سطح می‌رساند تا در زمان شما صرفه‌جویی شود. به علاوه، تمام اطلاعات با ترافیک نیم‌بها از طریق مایکت رد‌وبدل می‌شوند؛ این یعنی بدون نگرانی می‌توانید به دانلود بازی‌های حجیم‌تر بپردازید.
        برای علاقه‌مندان به بازی های اندروید ایرانی هستید، باید گفت تقریبا تمام عناوین و آثار مشهور از طریق مایکت قابل دریافت هستند.</p>
        <p className="text-sm">اگر قصد دانلود بازی اندروید برای گوشی هوشمند خود را دارید اما هیچ‌کدام از بازی‌ها را نمی‌شناسید، جای نگرانی نیست؛ در صفحه مربوط به هر بازی، تمام تصاویر و ویدیوهای مربوطه گردآوری شده‌اند تا قبل از دانلود بتوانید چشم‌انداز خوبی از محیط و شکل‌وشمایل بازی داشته باشید. به علاوه، تمام جزئیات و اطلاعات هر بازی در صفحه آن درج شده است که با مطالعه آنها می‌توان در مورد دریافت آن بازی تصمیم گرفت. اگر این موارد برای شما کافی نیست، باید گفت مایکت از سیستم امتیازدهی ویژه با امکان درج نظرات کاربران نیز بهره می‌برد؛ در نتیجه، با مطالعه دیدگاه‌های کاربران می‌توان اطلاعات کافی در مورد هر عنوان کسب کرد.</p>
        <h2 className="text-lg py-5 font-bold">تنوعی عالی از بازی های آفلاین و آنلاین</h2>
        <p className="text-sm">فارغ از اینکه طرفدار بازی موبایل آنلاین یا آفلاین باشید، تنوعی عالی از بازی‌ها در دسترس شماست تا متناسب با شرایط خود بتوانید از آنها استفاده کنید. برای انجام بازی های آفلاین اندرویدی، نیازی به اتصال اینترنت نداشته و در هر زمان و مکان می‌توانید با انجام آنها بر روی گوشی هوشمند خود، غرق در هیجان شوید! </p>
        <p className="text-sm">اگر طرفدار بازی های آنلاین هستید هم بد نیست بدانید که از بازی‌های دونفره تا عناوین گروهی که آدرنالین خون‌تان را به سقف می‌چسبانند، همگی از طریق اپلیکیشن مایکت قابل دریافت هستند. هرچند، همان‌طور که می‌دانید، این عناوین نیازمند اتصال اینترنت بوده و به همان نسبت، ترافیک بیشتری را هم مصرف می‌کنند.</p>
        <h2 className="text-lg py-5 font-bold">نصب آسان بازی های دیتا دار</h2>
        <p className="text-sm">دانلود و نصب بازی های حجیم و دیتا دار، یکی از مشکلاتی است که اکثر دارندگان گوشی های اندرویدی با آن مواجه هستند. به علاوه، از طریق بسیاری از پلتفرم‌ها و اپلیکیشن‌ها، امکان دریافت دیتای بازی وجود ندارد و لازم است کاربران، دیتا را به صورت جداگانه بر روی گوشی هوشمند خود کپی کنند. در بسیاری از موارد، دیتا از طریق خود بازی و بعد از نصب آن بر روی گوشی هوشمند دانلود می‌شود، اما این کار هم مشکلاتی مانند افت سرعت و قطعی دائم را دارد و می‌تواند بسیار آزاردهنده باشد.</p>
        <p className="text-sm">خوشبختانه، مایکت از سیستمی ویژه در این زمینه استفاده کرده و با دانلود و نصب خودکار دیتای بازی، این مشکل را برای همیشه رفع کرده است؛ در نتیجه، شما می‌توانید تمام بازی‌های کم‌حجم یا سنگین را بدون هیچ مشکل و با بالاترین سرعت، دانلود کرده و از بابت نصب صحیح دیتا نیز مطمئن باشید.</p>
        <h2 className="text-lg py-5 font-bold">انواع دسته بندی بازی موبایل برای اندروید</h2>
        <p className="text-sm">با توجه به تفاوت‌های زیادی که بین سلیقه‌های مختلف وجود دارد، بازی‌ها هم در انواع بسیار مختلفی تولید شده‌اند که در پایین، مهم‌ترین موارد را بیان می‌کنیم.</p>
        <h3 className="text-base pt-4 font-bold">استراتژی</h3>
        <p className="text-sm">بازی موبایل استراتژی، محبوب‌ترین دسته در میان عناوین موبایلی به حساب می‌آید و طرفداران بی‌شماری در سراسر جهان دارد. از سبک‌های کارتی و نوبتی تا شهرسازی و دفاع از قلعه، این بازی‌ها تنوعی بی‌نظیر داشته و انتخاب اول بسیاری از افراد برای دانلود بازی اندرویدی محسوب می‌شوند. بازی های استراتژی همچنین در دو نوع آفلاین و آنلاین توسعه یافته‌اند که هرکدام از آنها، جذابیت‌های خاص خود را دارند. «کلش آف کلنز» و «پسرخوانده» از محبوب‌ترین بازی‌های این سبک به حساب می‌آیند.</p>
        <h3 className="text-base pt-4 font-bold">اکشن</h3>
        <p className="text-sm">در بازی های اکشن، همه‌چیز در هیجان خلاصه می‌شود؛ این عناوین معمولا با زدوخوردهای فراوان همراه بوده و صحنه‌ها و لحظه‌های جذابی در آنها وجود دارد که می‌توانند هیجان را در روح شما زنده کنند. عناوین اکشن اندرویدی هم معمولا تنوع بالایی دارند و از بازی های مبارزه‌ای تا تفنگی، هرکدام از آنها در نوع خود بسیار جذاب هستند. اگر طالب هیجان بیشتری هم باشید، می‌توانید سراغ نمونه‌های آنلاین رفته و در کنار دیگر افراد، تجربه‌ای خاطره‌انگیز را برای خود رقم بزنید. <a className="text-[#00b0ff]" href="https://myket.ir/app/com.activision.callofduty.shooter">«کالاف دیوتی موبایل»</a> و «گارنا فری فایر» از جمله این عناوین هستند.</p>
        <h3 className="text-base pt-4 font-bold">تفننی</h3>
        <p className="text-sm">بسیاری از وقت‌ها، کاربران زمان کافی برای انجام یک بازی طولانی یا سخت را ندارند و فقط می‌خواهند چند لحظه‌ یا چند دقیقه‌ای را با انجام یک بازی ساده، سرگرم شوند؛ این‌ها همان <a className="text-[#00b0ff]" href="https://myket.ir/games/casual">بازی‌های تفننی </a> هستند که برای انجام آنها، معمولا نیازی به اینترنت یا آموزش‌های پیچیده نیست و خیلی سریع می‌توان مراحل مختلف را هم پشت سر گذاشت. “Candy Crush Saga” و همچنین "Cut the Rope"، از محبوب‌ترین و مشهورترین بازی های تفننی هستند که حسابی می‌توانند شما را سرگرم کنند. </p>
        <h3 className="text-base pt-4 font-bold">رانندگی</h3>
        <p className="text-sm">رسیدن به سرعت‌های بالا و لایی کشیدن در خیابان، از همان کودکی یکی از رویاهای همیشگی بسیاری از افراد بوده است؛ با دانلود بازی اندروید در سبک رانندگی، این رویا به واقعیت تبدیل می‌شود! <a className="text-[#00b0ff]" href="https://myket.ir/games/racing"> بازی های رانندگی اندروید </a>  در سبک‌های مختلفی تولید شده‌اند که با نصب آنها می‌توان با انواع مختلفی از وسایل مانند اتومبیل، اتوبوس، کامیون، موتور، دوچرخه و حتی کشتی رانندگی کرد. «کلاچ» و «آسفالت 9» از بهترین بازی های رانندگی اندرویدی هستند که همین حالا می‌توانید آنها را تجربه کنید.</p>
        <h3 className="text-base pt-4 font-bold">شبیه سازی</h3>
        <p className="text-sm">در این بازی‌ها، معمولا یک شغل یا تخصص مانند مزرعه‌داری یا رانندگی مورد توجه بوده و بیش از هر چیز دیگری به جزئیات توجه می‌شود تا کاربران بتوانند به کامل‌ترین شکل، آن را تجربه کنند. «شریف آباد» و «سرآشپز باشی» از محبوب‌ترین عناوین برای افرادی به حساب می‌آیند که به دنبال بازی اندروید شبیه سازی برای گوشی هوشمند خود هستند. </p>
        <h3 className="text-base pt-4 font-bold">فکری</h3>
        <p className="text-sm">خیلی وقت‌ها، یک بازی اندروید فکری می‌تواند هیجانی به‌مراتب بالاتر از یک عنوان اکشن برای شما داشته باشد چرا که چالش‌ها و معماهای موجود در بازی به اندازه‌ای پیچیده و البته جذاب می‌شوند که برای حل آنها باید دقت زیادی به خرج داد. برخی از بازی‌ها هم با تلفیق المان‌های بازی فکری و تفننی، عنوانی سرگرم‌کننده را پیش روی مخاطبان قرار می‌دهند که در عین سادگی، جذابیت بالایی دارند. “Happy Glass” و “Where’s My Water 2” در زمره همین بازی‌ها قرار می‌گیرند.</p>
        <h3 className="text-base pt-4 font-bold">کلمات و دانستنی ها</h3>
        <p className="text-sm">افراید که اطلاعات عمومی خوبی دارند و سوالات مختلف را زودتر از بقیه پاسخ دهند، با دانلود بازی های اندرویدی در سبک دانستنی می‌توانند مهارت‌های خود را به چالش بکشند. این روزها، عناوینی که در زمینه حدس کلمات یا کنار هم قرار دادن حروف مختلف هستند نیز محبوبیت زیادی میان کاربران پیدا کرده‌اند و می‌توانند مخاطبان را در دنیایی هیجان‌انگیز با خود همراه کنند تا عبارت‌ها و کلمات جدید را یاد گرفته و از انجام بازی‌ها هم لذت نهایت لذت را ببرند. «کوییز آف کینگز» و «فندق» از جمله همین بازی‌ها هستند.</p>
        <h3 className="text-base pt-4 font-bold">ماجراجویی</h3>
        <p className="text-sm">مهم‌ترین ویژگی بازی های ماجراجویی، داستان‌پردازی و توجه سازندگان به شخصیت‌های بازی است. با دانلود بازی موبایل سبک ماجراجویی می‌توانید خود را در داستان‌های هیجان‌انگیز مختلف غرق کرده و هیجانی بسیار بالا را تجربه کنید. بازی‌های ماجراجویی می‌توانند با سبک‌های دیگر مانند اکشن و استراتژی نیز تلفیق شوند. "Into the Dead" و همچنین «رانده شده» از بازی های جالب این سبک به حساب می‌آیند.</p>
        <h3 className="text-base pt-4 font-bold">ورزشی</h3>
        <p className="text-sm">بازی های ورزشی اندرویدی به واسطه هیجان بالایی که دارند، همیشه یکی از جذاب‌ترین عناوین برای گیمرها به حساب می‌آیند. نکته قابل توجه، امکان انجام این بازی‌ها به صورت گروهی با دوستان یا سایر افراد از سراسر دنیاست؛ در این صورت می‌توانید هیجانی تکرارنشدنی را روی گوشی و زیر انگشتان خود تجربه کنید. «دریم لیگ ساکر» و فیفا موبایل با گیم‌پلی اعتیادآور و هیجان بسیار بالایی که دارند، می‌توانند ساعت‌ها شما را سرگرم کنند.</p>
        <h3 className="text-base pt-4 font-bold">کودکانه</h3>
        <p className="text-sm">مایکت برای کودکان هم بازی‌های جذاب و متنوعی دارد و افرادی که قصد دانلود بازی اندروید بچگانه را دارند، دست خالی از این اپلیکیشن بیرون نخواهند رفت. بازی های بچگانه و کودکانه اندرویدی، معمولا فضایی شاد و رنگارنگ با گیم‌پلی بسیار ساده دارند که باعث می‌شود خیلی راحت و سریع بتوانید آنها را روی گوشی خود انجام دهید. این بازی‌ها همچنین می‌توانند حالتی آموزشی داشته و چیزهای مختلفی را به کودکان یاد دهند. «دانشمند کوچولو» و «پاپیتا فارسی» از بهترین نمونه های بازی اندروید کودکانه است. </p>
      </article>
      <span onClick={descManager} id="DescriptionToggle" className="containerCat block w-full py-3 cursor-pointer text-[#00b0ff] text-xs text-center font-bold">{descBtnContent}</span>
    </>
  );
}

export default Description;

