// import '../../App.css';
// import { getJson, postJson, deleteJson } from './fetch';


function Questions() {
  return (
    <article className="containerCat text-justify text-[#e0e0e0] pb-10">
      <h2 className="text-lg py-5 font-bold">سوالات متداول</h2>
      <h3 className="text-sm py-4 font-bold">چطور بازی دیتادار را روی گوشی اندرویدی خود نصب کنیم؟</h3>
      <p className="text-sm">بازی های موبایل سنگین‌تر اندرویدی، معمولا داده‌های خود را در قالب چیزی به نام «دیتا» ارائه می‌کنند که در آن می‌توان آیتم‌ها، جزئیات، محیط‌ها و مواردی از این دست را پیدا کرد. نصب دیتای بازی به صورت دستی، کمی پیچیده و بعضا زمان‌بر است، ولی اگر بازی های دیتادار را از مایکت دانلود کرده باشید، دیتای بازی هم به صورت خودکار روی گوشی نصب شده و اپلیکیشن مایکت، تمام کارها را خود انجام می‌دهد.</p>
      <h3 className="text-sm py-4 font-bold">آیا بازی های موبایل مایکت ایمن هستند؟</h3>
      <p className="text-sm">بله؛ تمام بازی های اندرویدی داخل مایکت، پیش از انتشار، توسط سپر امنیتی این پلتفرم اسکن می‌شوند تا هیچ بدافزار، ویروس یا فایل مخربی در آنها وجود نداشته باشد.</p>
      <h3 className="text-sm py-4 font-bold">آیا می‌توان همه بازی ها را روی گوشی و تبلت نصب کرد؟</h3>
      <p className="text-sm">بله؛ اگر در مورد توانایی تبلت یا موبایل خود در اجرای بازی‌ها مطمئن هستید، می‌توانید همه عناوین را به صورت رایگان نصب کنید. البته، بازی‌های سنگین‌تر ممکن است با تاخیر بیشتری روی دستگاه‌های ضعیف‌تر اجرا شوند.</p>
    </article>
  );
}

export default Questions;

