// import '../../App.css';
// import { getJson, postJson, deleteJson } from './fetch';

import { useState } from 'react';
import { IoIosArrowDown } from "react-icons/io";
import { IoIosArrowUp } from "react-icons/io";

function Description() {
  const [descClass, setDescClass]= useState("relative containerCat py-5 text-justify text-[#e0e0e0] smallDesc");
  const [descBtnContent, setDescBtnContent] = useState(<>مشاهده بیشتر <IoIosArrowDown className='inline' size={18} /> </>);
  function descManager(){
    if(descClass==="relative containerCat py-5 text-justify text-[#e0e0e0] smallDesc"){
      setDescClass("relative containerCat py-5 text-justify text-[#e0e0e0]");
      setDescBtnContent(<>مشاهده کمتر <IoIosArrowUp className='inline' size={18} /> </>);
    }
    else{
      setDescClass("relative containerCat py-5 text-justify text-[#e0e0e0] smallDesc");
      setDescBtnContent(<>مشاهده بیشتر <IoIosArrowDown className='inline' size={18} /> </>);
    }
    //console.log(descClass)
  }
  return (
    <>
      <article id="longDescription" className={descClass}>
        <p className="text-sm">افرادی که قصد <strong>دانلود برنامه اندروید</strong> برای گوشی هوشمند خود را دارند، احتمالا جایی بهتر از مایکت را پیدا نخواهند کرد؛ یکی از بزرگترین مارکت‌های اپلیکیشن در ایران که ضمن دانلود انواع بازی و تماشای فیلم و سریال، از طریق آن می‌توان جدیدترین نرم افزارهای اندرویدی را هم پیدا کرد. برای استفاده از <strong>مایکت</strong> و نصب جدیدترین <strong>اپلیکیشن های اندرویدی</strong>، فقط باید نرم‌افزار آن را روی گوشی هوشمند خود نصب کنید تا دنیایی بی‌انتها از انواع نرم‌‌افزارها پیش روی شما قرار بگیرد.</p>
        
        <h2 className="text-lg py-5 font-bold">دانلود برنامه اندروید برای گوشی به صورت رایگان</h2>
        <p className="text-sm">ده‌ها هزار نرم افزار اندروید آماده دریافت از طریق مایکت هستند؛ این یعنی پیدا کردن اپلیکیشن مورد نیاز از میان انبوه برنامه‌ها، کار دشواری خواهد بود. مایکت با ارائه دسته‌بندی بسیار خوب، به کاربران کمک می‌کند تا خیلی سریع، برنامه دلخواه‌شان را پیدا کرده و آن را روی گوشی هوشمند خود نصب کنند.</p>
        <p className="text-sm">مسئله مهم‌تر، به‌روز بودن تمام نرم‌افزارهایی است که در این پلتفرم در دسترس کاربران هستند. به بیان دیگر، برای آپدیت برنامه های اندرویدی، نیازی به مراجعه به وب‌سایت تک به تک این برنامه‌ها بنوده و شما صرفا از طریق این پلتفرم و گوشی خود می‌توانید به صورت دوره‌ای، آخرین نسخه از اپلیکیشن‌ها را دانلود و روی گوشی خود نصب کنید. خوشبختانه، مایکت از سیستم هوش مصنوعی بهره می‌برد تا اطلاعات با بالاترین سرعت ممکن رد و بدل شده و بر روی گوشی نصب شوند.</p>
        <p className="text-sm">بسیاری از افراد در مورد امنیت اپلیکیشن هایی که بر روی این پلتفرم ارائه می‌شود، نگران هستند؛ در این مورد باید گفت که مایکت از یک سپر امنیتی بسیار ویژه برخودار است که پیش از انتشار محتوا، تمام نرم‌افزارها را به صورت تک به تک اسکن می‌کند تا هیچ ویروس، بد افزار یا فایل مخربی همراه با این برنامه‌ها روی گوشی کاربران نصب نشود.</p>
        <p className="text-sm">به علاوه، کاربران می‌توانند در صورت مواجهه با هرگونه مشکل در زمینه نصب برنامه اندروید روی گوشی خود، با تیم مایکت ارتباط برقرار کرده و از کارشناسان این مجموعه برای حل مشکل، کمک بگیرند.</p>
        <h2 className="text-lg py-5 font-bold">دسته بندی برنامه های اندرویدی</h2>
        <p className="text-sm">ده‌ها هزار نرم افزار اندروید آماده دریافت از طریق مایکت هستند؛ این یعنی پیدا کردن اپلیکیشن مورد نیاز از میان انبوه برنامه‌ها، کار دشواری خواهد بود. مایکت با ارائه دسته‌بندی بسیار خوب، به کاربران کمک می‌کند تا خیلی سریع، برنامه دلخواه‌شان را پیدا کرده و آن را روی گوشی هوشمند خود نصب کنند.</p>
        <h3 className="text-base pt-4 font-bold">آب و هوا</h3>
        <p className="text-sm">با دانلود برنامه اندروید آب و هوا، شما در هر لحظه می‌توانید وضعیت دقیق آب‌وهوایی برای شهرهای مختلف را مشاهده کرده و برای سفر یا کارهای خود برنامه‌ریزی داشته باشید. بسیاری از اپلیکیشن های آب و هوا اطلاعات کاملی در مورد سرعت باد، میزان رطوبت و ... را نیز در اختیار کاربران قرار می‌دهند. Yahoo Weather یکی از محبوب‌ترین نرم‌افزارهای آب‌وهوا است.</p>
        <h3 className="text-base pt-4 font-bold">اخبار</h3>
        <p className="text-sm">با اپلیکیشن های مربوط به خبر اندروید، همیشه می‌توانید از جدیدترین رویدادها و مطالب روز باخبر باشید. این نرم‌افزارها که برای استفاده از آنها به اتصال اینترنت هم نیاز خواهید داشت، تمام خبرهای داخلی و خارجی را به صورت لحظه‌ای پوشش داده و کمک می‌کنند تا زودتر از همه، از خبرها مطلع شوید.  “Google News” و «آخرین خبر» از جمله بهترین برنامه‌های این حوزه است.</p>
        <h3 className="text-base pt-4 font-bold">امور مالی</h3>
        <p className="text-sm">با پیشرفت فناوری و توسعه گوشی‌های هوشمند، حالا مدیریت امور مالی یا انجام کارهای بانکی، ساده‌تر از همیشه شده و کاربران می‌توانند با استفاده از موبایل خود، کارهای مختلفی مانند پرداخت‌های اینترنتی، خرید آنلاین، جابجایی پول و ... را انجام دهند. برنامه اندروید حوزه امور مالی، بسیار گسترده بوده و از همراه‌ بانک‌ها تا نرم‌افزارهای حسابداری شخصی و خرید و فروش ارز دیجیتال را شامل می‌شوند. <a className="text-[#00b0ff]" href="https://myket.ir/app/com.sibche.aspardproject.app">«آپ»</a> و «اکسکوینو» از بهترین اپلیکیشن‌ها در این زمینه به حساب می‌آید.</p>
        <h3 className="text-base pt-4 font-bold">پزشکی و سلامت</h3>
        <p className="text-sm">اگر توجهی ویژه به سلامتی خود دارید یا می‌خواهید از جدیدترین اخبار و آموزش‌های مرتبط با حوزه سلامت و پزشکی مطلع شوید، نرم افزارهای اندرویدی حوزه سلامت و پزشکی می‌توانند برای شما مفید باشند. شما با استفاده از این برنامه‌ها حتی می‌توانید از کارشناسان حوزه‌های مختلف، مشاوره دریافت کرده یا رژیم غذایی خودتان را کنترل کنید. «کرفس» محبوب‌ترین برنامه برای کنترل رژیم و کالری مصرفی است؛ با «پذیرش 24» هم می‌توانید در هر ساعت از شبانه‌روز، از پزشکان و متخصصان وقت بگیرید.</p>
        <h3 className="text-base pt-4 font-bold">خرید</h3>
        <p className="text-sm">اگر اهل خرید اینترنتی باشید، حتما می‌دانید که بسیاری از فروشگاه‌های آنلاین، یک نسخه موبایلی هم دارند که خرید را لذت‌بخش‌تر می‌کنند؛ به علاوه، با استفاده از برخی از سرویس‌ها و نرم‌افزارها می‌توان قیمت محصولات فروشگاه‌های مختلف را با یکدیگر مقایسه کرده و ارزان‌ترین فروشنده خرید کرد. <a className="text-[#00b0ff]" href="https://myket.ir/app/ir.torob">«ترب»</a> و «ایمالز» دو نرم‌افزار این حوزه با میلیون‌ها کاربر هستند که به کمک آنها می‌توان قیمت فروشگاه‌های دیگر را مقایسه و محصولات را با کمترین قیمت خریداری کرد. </p>
        <h3 className="text-base pt-4 font-bold">سرگرمی</h3>
        <p className="text-sm">با دانلود برنامه های فیلم و سریال برای اندروید، می‌توانید تازه‌ترین عناوین تلویزیونی و سینمایی را روی گوشی خود مشاهده کرده و از تماشای آنها نهایت لذت را ببرید؛ در این دسته‌بندی، اپلیکیشن های دیگری در حوزه تلویزیون آنلاین یا پلتفرم‌های اینترنتی نیز وجود دارند که با نصب آنها می‌توان حسابی سرگرم شد. «تلوبیون» با آرشیو کاملی از برنامه‌های تلویزیونی و امکان پخش آنلاین شبکه‌های صداوسیما در کنار «آنتن» با قابلیت پخش زنده مسابقات ورزشی، از جمله محبوب‌ترین نرم‌افزارها در این حوزه به حساب می‌آیند.</p>
        <h3 className="text-base pt-4 font-bold">شبکه های اجتماعی</h3>
        <p className="text-sm">امروزه شبکه‌های اجتماعی و پیام‌رسان‌ها به بخشی جدانشدنی از زندگی روزمره تبدیل شده و ارتباط ما با سایر افراد را به‌کلی دگرگون کرده‌اند. کاربران با استفاده از شبکه‌های اجتماعی می‌توانند لحظه‌های ناب را با سایرین به اشتراک گذاشته یا از طریق تماس تصویری، با دوستان خود در سراسر جهان صحبت کنند. <a className="text-[#00b0ff]" href="https://myket.ir/app/ir.torob">«روبیکا»</a> و «سروش» دو اپلیکیشن ایرانی محبوب در این زمینه هستند. </p>
        <h3 className="text-base pt-4 font-bold">صوت و موسیقی</h3>
        <p className="text-sm">برای افرادی که اهل شنیدن و موسیقی هستند، اپلیکیشن های زیادی وجود دارد که دسته‌بندی و پخش موسیقی با کیفیتی بالا را ممکن می‌کنند. شما همچنین می‌توانید با دانلود برنامه های پادکست و رادیو اینترنتی، شنیدن را به تفریحی بی‌انتها تبدیل کنید. “Mi Music” برای گوش کردن به موسیقی و «ایران صدا» برای رادیو اینترنتی، بهترین گزینه در این زمینه هستند.</p>
        <h3 className="text-base pt-4 font-bold">کتاب</h3>
        <p className="text-sm">کتاب‌خوانی با گوشی هوشمند، جذابیت‌های خاص خود را دارد و برای کتاب‌دوستان می‌تواند تفریحی بسیار جذاب باشد. با دانلود برنامه اندروید «طاقچه» می‌توانید یکی از بزرگترین کتابخانه‌های آنلاین را روی موبایل خود داشته و کتاب‌ها را با تخفیف‌های ویژه و قیمت‌های بسیار مناسب تهیه کنید.</p>
        <h3 className="text-base pt-4 font-bold">آشپزی و رستوران</h3>
        <p className="text-sm">شما با مراجعه به مایکت می‌توانید اپلیکیشن‌های آموزش آشپزی یا نرم‌افزارهایی که در زمینه راهنمای غذاها و رستوران‌ها هستند را نیز روی گوشی هوشمند خود نصب کنید. «آشپزی با سرآشپز پاپیون» به عنوان یکی از برنامه های اندرویدی موفق در این زمینه شناخته می‌شود.</p>
        <h3 className="text-base pt-4 font-bold">آموزشی</h3>
        <p className="text-sm">اپلیکیشن های آموزشی اندرویدی هم تنوع بسیار بالایی دارند و از آموزش زبان ها تا ورزش‌ها و تخصص‌های مختلف، می‌توانند در خدمت کاربران باشند. به علاوه، اگر فرزند مدرسه‌ای در منزل دارید هم این دسته‌بندی می‌تواند برای شما مفید باشد چرا که در میان آنها، اپلیکیشن‌های گام‌به‌گام هم در دسترس کاربران قرار دارند. «مای درس» به عنوان یکی از بهترین گام‌به‌گام‌ها و «لرنیت» به عنوان یکی از بهترین اپ‌های آموزش زبان انگلیسی شناخته می‌شود.</p>
        <h3 className="text-base pt-4 font-bold">تناسب اندام</h3>
        <p className="text-sm">مایکت برای افرادی که در زمینه ورزش و تناسب اندام نیز فعالیت دارند، گزینه‌های پیشنهادی زیادی دارد که با نصب بر روی گوشی و دنبال کردن تمرینات آنها می‌توان سلامت فیزیکی را تا حد زیادی بهبود بخشید. “Home Workout - No Equipment” یکی از بهترین نرم‌افزارها برای انجام تمرینات ورزشی بدون تجهیزات در خانه به حساب می‌آید.</p>
        <h3 className="text-base pt-4 font-bold">سیر و سفر</h3>
        <p className="text-sm">سفر کردن بدون دانلود برنامه اندروید مخصوص این کار، سفر را می‌تواند تا حد زیادی سخت کند. اپلیکیشن‌های مسیریاب مانند «نشان» یا «بلد» و نرم‌افزارهای رزرو اتاق و هتل مانند «هومسا» و «اقامت 24» از جمله برنامه‌های هستند که با با استفاده از آنها، خیلی ساده می‌توان برای سفر برنامه‌ریزی کرده و تجربه‌ای خاطره‌انگیز را برای خود رقم زد. </p>
        <h3 className="text-base pt-4 font-bold">شخصی سازی</h3>
        <p className="text-sm">اگر از ظاهر موبایل خود خسته شده‌اید و می‌خواهید سر و سامانی به آن بدهید، باید سراغ نرم‌افزارهای دسته شخصی سازی بروید. این برنامه‌ها کمک می‌کنند تا با عوض کردن تصویر صفحه، رنگ منوها و همچنین شکل بخش‌های مختلف، ظاهر گوشی را به صورت کامل دگرگون کنید. "Go Luncher" یکی از قدیمی‌ترین و بهترین اپلیکیشن های لانچر برای تغییر شکل ظاهری گوشی با صدها هزار کاربر در مایکت است.</p>
        <h3 className="text-base pt-4 font-bold">عکس و فیلم</h3>
        <p className="text-sm">امروزه، گوشی های هوشمند و اپلیکیشن‌های قدرتمند آنها می‌توانند شما را به یک ویرایشگر حرفه‌ای عکس و فیلم تبدیل کنند. اپلیکیشن <a className="text-[#00b0ff]" href="https://myket.ir/app/com.camerasideas.instashot">«اینشات»</a> و «اسنپ سید» از جمله برنامه‌هایی هستند که نیاز شما برای ویرایش تصاویر و ویدیوها را به صورت کامل مرتفع می‌کنند.</p>
        <h3 className="text-base pt-4 font-bold">کسب و کار</h3>
        <p className="text-sm">فرقی ندارد که کارجو باشید یا کارفرما؛ اپلیکیشن‌های حوزه کسب و کار در مایکت به شما کمک می‌کنند تا خیلی سریع، موقعیت شغلی یا کارمند دلخواه‌تان را پیدا کرده و مشغول کسب درآمد شوید! «ای استخدام» و «جاب ویژن» از جمله اپلیکیشن‌های موفق در این حوزه هستند.</p>
        <h3 className="text-base pt-4 font-bold">ورزشی</h3>
        <p className="text-sm">اپلیکیشن های ورزشی مایکت هم طرفداران زیادی میان کاربران دارند و نرم‌افزارهایی مانند «فوتبالی» و «فوتبال 360»، ضمن ارائه اطلاعات تحلیلی از بازی تیم‌های مختلف، شما را به دنیای بی‌انتهای فوتبال می‌برند تا در جذابیت‌های این بازی غرق شده و لحظات نابی را برای خودتان رقم بزنید.</p>
      </article>
      <span onClick={descManager} id="DescriptionToggle" className="containerCat block w-full py-3 cursor-pointer text-[#00b0ff] text-xs text-center font-bold">{descBtnContent}</span>
    </>
  );
}

export default Description;

